projetoRails/cicmonit/app/controllers/alunos_controller.rb

SELECT "alunos".* FROM "alunos"
---
  def index
    @alunos = Aluno.all

INSERT INTO "alunos" ("nome", "matricula", "semestre") VALUES (?, ?, ?)  [["nome", "Marcos"], ["matricula", "130143081"], ["semestre", 6]]
---
  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save

DELETE FROM "alunos" WHERE "alunos"."id" = ?  [["id", 2]]
---
  def destroy
    @aluno.destroy

SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_aluno
      @aluno = Aluno.find(params[:id])