projetoRails/cicmonit/app/controllers/dicentes_controller.rb

    def index
        @dicentes = Dicente.all
---
SELECT "dicentes".* FROM "dicentes"

    def show
        @dicente = Dicente.find(params[:id])
---
SELECT  "dicentes".* FROM "dicentes" WHERE "dicentes"."id" = ? LIMIT 1  [["id", 1]]

    def create
        @dicente = Dicente.new(dicente_params)
        if @dicente.save
---
INSERT INTO "dicentes" ("name", "email", "password_digest") VALUES (?, ?, ?)  [["name", "Luan Talles da Silva Araújo"], ["email", "luangoias@hotmail.com"], ["password_digest", "$2a$10$QIfPAM3g2/ZwDrFsy8WvbO8SOHlp9kL5Jbgm9dbcEEtCY4tyrfJQK"]]

    def edit
      @dicente = Dicente.find(params[:id])
---
SELECT  "dicentes".* FROM "dicentes" WHERE "dicentes"."id" = ? LIMIT 1  [["id", 1]]

    def update
      @dicente = Dicente.find(params[:id])
      if @dicente.update_attributes(dicente_params)
---
SELECT  "dicentes".* FROM "dicentes" WHERE "dicentes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "dicentes" SET "password_digest" = ? WHERE "dicentes"."id" = ?  [["password_digest", "$2a$10$VoUdRpQJopMmdR54U8g5KuHVomP2WvtSG3eW1RN8asPEtE3ID4kge"], ["id", 2]]

    def destroy
      @dicente = Dicente.find(params[:id])
      @dicente.destroy
---
SELECT  "dicentes".* FROM "dicentes" WHERE "dicentes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "dicentes" WHERE "dicentes"."id" = ?  [["id", 1]]