projetoRails/cicmonit/app/controllers/disciplinas_controller.rb

SELECT  "campus".* FROM "campus" WHERE "campus"."id" = ? LIMIT 1  [["id", 1]]
---
  def showDepartamentos
	@departamento = Campu.find(params[:id])

SELECT  "departamentos".* FROM "departamentos" WHERE "departamentos"."id" = ? LIMIT 1  [["id", 1]]
---
  def showDisciplinas
	@disciplina = Departamento.find(params[:id])

SELECT  "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."id" = ? LIMIT 1  [["id", 31]]
---
  def showTurmas
	@turma = Disciplina.find(params[:id])