projetoRails/cicmonit/app/controllers/sessions_controller.rb

SELECT  "dicentes".* FROM "dicentes" WHERE "dicentes"."email" = ? LIMIT 1  [["email", "luangoias@hotmail.com"]]
---
    def create
    @dicente = Dicente.find_by(email: params[:session][:email].downcase)