projetoRails/cicmonit/app/views/disciplinas/showCampus.html.erb

SELECT "campus".* FROM "campus"
---
</tr>
<% campus = Campu.all %>