projetoRails/cicmonit/app/views/disciplinas/showCandidatos.html.erb

SELECT "alunos".* FROM "alunos"
---
	</tr>
	<% @aluno = Aluno.all %>

SELECT  "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."id" = ? LIMIT 1  [["id", 1]]
---

					<% disciplina = Disciplina.find(turma.disciplina_id)%>